Repository: common-repository/autoglot
Catalog: translation/autoglot-*.po
Languages: ru_ru

source: There was an error during installation or activation of Autoglot plugin: Autoglot table has not been created in DB. Please contact site administrator or Autoglot support.
ru_ru: При установке или активации плагина Autoglot произошла ошибка: таблица Autoglot не создана в БД. Пожалуйста, свяжитесь с администратором сайта или службой поддержки Autoglot.

source: Autoglot Setup
ru_ru: Настройка Autoglot

source: Autoglot Dashboard
ru_ru: Панель управления Autoglot

source: Dashboard
ru_ru: Панель приборов

source: Settings
ru_ru: Настройки

source: Languages
ru_ru: Языки

source: Advanced
ru_ru: Дополнительно

source: Links Modifier
ru_ru: Модификатор ссылок

source: Text Replacement
ru_ru: Замена текста

source: Utilities
ru_ru: Утилиты

source: Delete Empty Translation
ru_ru: Удалить пустой перевод

source: Delete Duplicate Translation
ru_ru: Удалить повторяющийся перевод

source: Backup Translation Table
ru_ru: Резервная таблица перевода

source: Main Configuration
ru_ru: Основная конфигурация

source: Language Switcher
ru_ru: Переключатель языка

source: Flags
ru_ru: Флаги

source: Translation Settings
ru_ru: Настройки перевода

source: Output Settings
ru_ru: Настройки вывода

source: Language Code Insertion
ru_ru: Вставка языкового кода

source: Useful Plugin Utilities
ru_ru: Полезные плагины

source: Delete Empty Translations
ru_ru: Удалить пустые переводы

source: Delete Duplicate Translations
ru_ru: Удалить повторяющиеся переводы

source: Backup Translation DB
ru_ru: Резервная база данных перевода

source: Autoglot is a plugin for a WordPress platform that makes your website or blog SEO-friendly multilingual and translates all your content automatically using the best neural machine translation solutions.
ru_ru: Autoglot — это плагин для платформы WordPress, который делает ваш веб-сайт или блог оптимизированным для SEO многоязычным и автоматически переводит весь ваш контент, используя лучшие решения для нейронного машинного перевода.

source: Thank you for choosing <strong>Autoglot Translation plugin</strong>. This quick setup wizard will help you configure the basic settings. Let's start with your API key!
ru_ru: Благодарим вас за выбор <strong>Плагин перевода Autoglot</strong>. Этот мастер быстрой настройки поможет вам настроить основные параметры. Начнем с вашего ключа API!

source: <a href="%s" target="_blank">Please register in our Autoglot Control Panel</a> and receive your unique API key. This key should be kept secret and never shared with anyone.
ru_ru: <a href="%s" target="_blank">Зарегистрируйтесь в нашей панели управления Autoglot</a> и получите свой уникальный ключ API. Этот ключ следует хранить в секрете и никогда никому не передавать.

source: Registration is free and takes only a few moments. You don't need a credit card, any payment or subscription to get your API key.
ru_ru: Регистрация бесплатна и занимает всего несколько минут. Вам не нужна кредитная карта, какие-либо платежи или подписка, чтобы получить ключ API.

source: Please setup your languages here. You can choose as many languages as you want but we recommend that you start with only one language.
ru_ru: Пожалуйста, настройте свои языки здесь. Вы можете выбрать столько языков, сколько захотите, но мы рекомендуем начать только с одного языка.

source: You may skip this step and choose languages for translation later.
ru_ru: Вы можете пропустить этот шаг и выбрать языки для перевода позже.

source: <strong>Autoglot plugin has been successfully configured and is now ready to translate your website!</strong> Please use the links below to access dashboard or open your website:
ru_ru: <strong>Плагин Autoglot успешно настроен и теперь готов к переводу вашего веб-сайта!</strong> Используйте ссылки ниже, чтобы получить доступ к панели управления или открыть свой веб-сайт:

source: <strong>Open your website in chosen languages!</strong> Please be aware of your balance. We recommend that you start with one language and once satisfied, proceed with more languages:
ru_ru: <strong>Откройте свой веб-сайт на выбранных языках!</strong> Следите за своим балансом. Мы рекомендуем вам начать с одного языка и, как только вы будете удовлетворены, перейти к большему количеству языков:

source: <strong>You have not selected languages for translation.</strong> No worries, you may do so later on language settings page:
ru_ru: <strong>Вы не выбрали языки для перевода.</strong> Не беспокойтесь, вы можете сделать это позже на странице настроек языка:

source: <a href="%s" class="button" target="_blank"><i class="dashicons dashicons-admin-site"></i> Language Settings</a>
ru_ru: <a href="%s" class="button" target="_blank"><i class="dashicons Dashicons-admin-site"></i> Языковые настройки</a>

source: <strong>You may want to add an Autoglot language switcher to your widgets.</strong> This will let your visitors switch site languages. This widget can be added to almost any widgets area: sidebars, footers, etc.
ru_ru: <strong>Возможно, вы захотите добавить в свои виджеты переключатель языка Autoglot.</strong> Это позволит вашим посетителям переключать языки сайта. Этот виджет можно добавить практически в любую область виджетов: боковые панели, нижние колонтитулы и т. д.

source: <a href="%s" class="button" target="_blank"><i class="dashicons dashicons-screenoptions"></i> Setup Autoglot Widget</a>
ru_ru: <a href="%s" class="button" target="_blank"><i class="dashicons Dashicons-screenoptions"></i> Настройка виджета Autoglot</a>

source: <strong>Your theme currently does not support widgets.</strong> No worries, Autoglot will function without widgets area. You may add language switcher in popup or as a shortcode via Autoglot Dashboard.
ru_ru: <strong>Ваша тема в настоящее время не поддерживает виджеты.</strong> Не беспокойтесь, Autoglot будет работать без области виджетов. Вы можете добавить переключатель языка во всплывающем окне или в виде короткого кода через панель управления Autoglot.

source: <strong>Autoglot translation has not been enabled.</strong> Before trying and testing plugin you should enable Autoglot translation in main settings:
ru_ru: <strong>Перевод Autoglot не включен.</strong> Прежде чем попробовать и протестировать плагин, вам следует включить перевод Autoglot в основных настройках:

source: <a href="%s" class="button"><i class="dashicons dashicons-admin-settings"></i> Main Settings</a>
ru_ru: <a href="%s" class="button"><i class="dashicons Dashicons-admin-settings"></i> Основные настройки</a>

source: <strong>Autoglot Dashboard is the main place to start.</strong> This will display your translation statistics, available balance (number of words you can translate), and other useful statistics:
ru_ru: <strong>Панель управления Autoglot – это основная отправная точка.</strong> Здесь будет отображаться ваша статистика переводов, доступный баланс (количество слов, которые вы можете перевести) и другая полезная статистика:

source: <a href="%s" class="button"><i class="dashicons dashicons-analytics"></i> Autoglot Dashboard</a>
ru_ru: <a href="%s" class="button"><i class="dashicons Dashicons-analytics"></i> Панель управления Autoglot</a>

source: Autoglot Account Stats
ru_ru: Статистика аккаунта Autoglot

source: Statistics of your Autoglot account.
ru_ru: Статистика вашего аккаунта Autoglot.

source: Translation balance
ru_ru: Баланс перевода

source: Your current Autoglot translation balance (number of words you can translate):
ru_ru: Ваш текущий баланс переводов Autoglot (количество слов, которые вы можете перевести):

source: You can replenish your translation balance in your <a href="%s" target="_blank" class="button">Autoglot Control Panel</a>
ru_ru: Вы можете пополнить баланс переводов в <a href="%s" target="_blank" class="button">Панели управления Autoglot</a>.

source: We could not connect to Autoglot API with your API key.
ru_ru: Нам не удалось подключиться к API Autoglot с помощью вашего ключа API.

source: Please login to <a href="%s" target="_blank">Autoglot Control Panel</a> and retrieve your API key.
ru_ru: Пожалуйста, войдите в <a href="%s" target="_blank">Панель управления Autoglot</a> и получите свой ключ API.

source: Please then set your API key in <a href="%s">Autoglot Settings Page</a>.
ru_ru: Затем установите свой ключ API на <a href="%s">странице настроек Autoglot</a>.

source: You have not set up your API key! Autoglot Translation Plugin will not translate your content without a correct API key.
ru_ru: Вы не настроили свой ключ API! Плагин перевода Autoglot не будет переводить ваш контент без правильного ключа API.

source: You can get your API key in your <a href="%s" target="_blank">Autoglot Control Panel</a>.
ru_ru: Вы можете получить ключ API в своей <a href="%s" target="_blank">панели управления Autoglot</a>.

source: Autoglot Plugin Stats
ru_ru: Статистика плагина Autoglot

source: Status of Autoglot plugin.
ru_ru: Статус плагина Autoglot.

source: Autoglot plugin status
ru_ru: Статус плагина Autoglot

source: Valid API key:
ru_ru: Действительный ключ API:

source: Please set up your API key here.
ru_ru: Пожалуйста, настройте свой ключ API здесь.

source: Autoglot plugin enabled:
ru_ru: Плагин Autoglot включен:

source: Click here to enable translation.
ru_ru: Нажмите здесь, чтобы включить перевод.

source: Translation available to every visitor:
ru_ru: Перевод доступен каждому посетителю:

source: Translation is visible for administrator only.
ru_ru: Перевод виден только администратору.

source: Click here to enable translation for everyone.
ru_ru: Нажмите здесь, чтобы включить перевод для всех.

source: Translation languages enabled:
ru_ru: Языки перевода включены:

source: Click here to activate languages.
ru_ru: Нажмите здесь, чтобы активировать языки.

source: Language switcher enabled:
ru_ru: Переключатель языка включен:

source: <a href="%1$s">Autoglot widget</a> is active.
ru_ru: <a href="%1$s">Виджет Autoglot</a> активен.

source: <a href="%1$s">Autoglot widget</a> is not active.
ru_ru: <a href="%1$s">Виджет Autoglot</a> не активен.

source: Widgets are not supported.
ru_ru: Виджеты не поддерживаются.

source: <a href="%s">Floating language switcher</a> is active.
ru_ru: <a href="%s">Плавающий переключатель языка</a> активен.

source: <a href="%2$s">Floating language switcher</a> is not active.
ru_ru: <a href="%2$s">Плавающий переключатель языка</a> не активен.

source: Statistics of Autoglot plugin usage.
ru_ru: Статистика использования плагина Autoglot.

source: Translation DB stats
ru_ru: Статистика БД переводов

source: Number of records in Autoglot translation DB:
ru_ru: Количество записей в БД переводов Autoglot:

source: Number of unique phrases in Autoglot translation DB:
ru_ru: Количество уникальных фраз в БД переводов Autoglot:

source: Number of translated words in Autoglot translation DB:
ru_ru: Количество переведенных слов в БД переводов Autoglot:

source: Number of unique languages in Autoglot translation DB:
ru_ru: Количество уникальных языков в БД переводов Autoglot:

source: Total size of Autoglot translation DB:
ru_ru: Общий размер БД переводов Autoglot:

source: Most recent translation:
ru_ru: Самый последний перевод:

source: Statistics of Autoglot plugin settings.
ru_ru: Статистика настроек плагина Autoglot.

source: Plugin settings stats
ru_ru: Статистика настроек плагина

source: Number of active languages (including default):
ru_ru: Количество активных языков (в том числе по умолчанию):

source: Number of all available languages:
ru_ru: Количество всех доступных языков:

source: Plugin version:
ru_ru: Версия плагина:

source: Active languages:
ru_ru: Активные языки:

source: Your Feedback
ru_ru: Ваш отзыв

source: Your feedback provides us with key information about what you think as a user of our plugin and helps us make informed decisions about future enhancements; it also helps us identify area where we are doing a good job and where we need to improve.
ru_ru: Ваш отзыв предоставляет нам ключевую информацию о том, что вы думаете как пользователь нашего плагина, и помогает нам принимать обоснованные решения о будущих улучшениях; это также помогает нам определить области, в которых мы делаем хорошую работу и где нам необходимо совершенствоваться.

source: If you enjoy our plugin, please do not hesitate to rate us and submit your feedback. It's always much appreciated!
ru_ru: Если вам нравится наш плагин, пожалуйста, не стесняйтесь оценить нас и оставить свой отзыв. Это всегда очень ценно!

source: Rate this plugin
ru_ru: Оцените этот плагин

source: About Autoglot
ru_ru: Об Autoglotе

source: Learn more about Autoglot using the links below:
ru_ru: Узнайте больше об Autoglot, перейдя по ссылкам ниже:

source: Official Website
ru_ru: Официальный веб-сайт

source: Pricing Information
ru_ru: Информация о ценах

source: Control Panel
ru_ru: Панель управления

source: Official Documentation
ru_ru: Официальная документация

source: Autoglot Support
ru_ru: Поддержка Autoglot

source: Do you need some help with our plugin? Or you may want to ask us a question, offer an idea, or request some assistance.
ru_ru: Вам нужна помощь с нашим плагином? Или вы можете задать нам вопрос, предложить идею или попросить о помощи.

source: Our support team is always eager to help you get the most out of Autoglot plugin by answering your support questions, preventing possible issues, and helping you resolve all technical questions.
ru_ru: Наша служба поддержки всегда готова помочь вам максимально эффективно использовать плагин Autoglot, отвечая на ваши вопросы, предотвращая возможные проблемы и помогая вам решить все технические вопросы.

source: There are a few channels to request help from us:
ru_ru: Есть несколько каналов, по которым можно обратиться к нам за помощью:

source: Support Ticket
ru_ru: Запрос в службу поддержки

source: WordPress Forums
ru_ru: Форумы WordPress

source: Facebook Page
ru_ru: Страница на фэйсбуке

source: Twitter Profile
ru_ru: Профиль в Твиттере

source: LinkedIn Community
ru_ru: Сообщество LinkedIn

source: These are settings for the basic configuration of Autoglot plugin.
ru_ru: Это настройки базовой конфигурации плагина Autoglot.

source: Widget
ru_ru: Виджет

source: Autoglot provides a useful widget that lets your visitors switch languages and open appropriate version of your website. You can find our widget in your WordPress widget area by searching for "Autoglot".
ru_ru: Autoglot предоставляет полезный виджет, который позволяет вашим посетителям переключать языки и открывать соответствующую версию вашего сайта. Вы можете найти наш виджет в области виджетов WordPress, выполнив поиск «Autoglot».

source: Shortcode
ru_ru: Короткий код

source: Alternatively, you can use a <code>%s</code> shortcode to add a language switcher to your website posts, pages, popups, etc.
ru_ru: Кроме того, вы можете использовать короткий код <code>%s</code>, чтобы добавить переключатель языка к сообщениям, страницам, всплывающим окнам и т. д. вашего сайта.

source: Add a "%s" argument if you want to set a custom title of this box: <code>%s</code>.
ru_ru: Добавьте аргумент «%s», если вы хотите установить собственный заголовок этого поля: <code>%s</code>.

source: Use a "%s" argument in order to select a type of language switcher:
ru_ru: Используйте аргумент «%s», чтобы выбрать тип переключателя языка:

source: Popup
ru_ru: Всплывающее окно

source: Finally, you can enable a popup language switcher. This will add a floating box to your website. By clicking on this box, users will see a popup window with language switcher. This is the best solution if you don't want to add widgets or shortcodes to your website.
ru_ru: Наконец, вы можете включить переключатель языка во всплывающем окне. Это добавит плавающее поле на ваш сайт. Нажав на это поле, пользователи увидят всплывающее окно с переключателем языка. Это лучшее решение, если вы не хотите добавлять виджеты или шорткоды на свой сайт.

source: Please setup your languages here.
ru_ru: Пожалуйста, настройте свои языки здесь.

source: Please choose the most appropriate flags for a language switcher.
ru_ru: Пожалуйста, выберите наиболее подходящие флаги для переключателя языка.

source: These are advanced translation settings. Please use with caution!
ru_ru: Это расширенные настройки перевода. Пожалуйста, используйте с осторожностью!

source: These are advanced output settings. Please use with caution!
ru_ru: Это расширенные настройки вывода. Пожалуйста, используйте с осторожностью!

source: You can add current language code to any link or text on your website. Default language does not update or replace any link.
ru_ru: Вы можете добавить текущий код языка к любой ссылке или тексту на вашем сайте. Язык по умолчанию не обновляет и не заменяет какие-либо ссылки.

source: The <code>%s</code> shortcode in your updated link will be replaced by current language code e.g. "es", "de", "el", "da", "sv".
ru_ru: Короткий код <code>%s</code> в обновленной ссылке будет заменен текущим кодом языка, например «es», «de», «el», «da», «sv».

source: The <code>%s</code> shortcode in your updated link will be replaced by top level domain extension of the country e.g. "es", "de", "gr", "dk", "se", etc.
ru_ru: Короткий код <code>%s</code> в вашей обновленной ссылке будет заменен расширением домена верхнего уровня страны, например. «es», «de», «gr», «dk», «se» и т. д.

source: For example, if you want to replace all links to wikipedia.com to the corresponding pages of es.wikipedia.org on the Spanish version of your website, you would enter <code>en.wikipedia.com</code> in the "Original Link" box and <code>%s.wikipedia.com</code> in the "Updated Link" box.
ru_ru: Например, если вы хотите заменить все ссылки на wikipedia.com на соответствующие страницы es.wikipedia.org в испанской версии вашего веб-сайта, вам следует ввести <code>en.wikipedia.com</code> в поле " Исходная ссылка» и <code>%s.wikipedia.com</code> в поле «Обновленная ссылка».

source: As a result, a link to <ins>https://en.wikipedia.org/wiki/WordPress</ins> in your English version will be replaced with <ins>https://es.wikipedia.org/wiki/WordPress</ins> on the Spanish version of your website; <ins>https://de.wikipedia.org/wiki/WordPress</ins> on the German version, etc.
ru_ru: В результате ссылка на <ins>https://en.wikipedia.org/wiki/WordPress</ins> в вашей английской версии будет заменена на <ins>https://es.wikipedia.org/wiki/. WordPress</ins> на испанской версии вашего сайта; <ins>https://de.wikipedia.org/wiki/WordPress</ins> в немецкой версии и т. д.

source: * This will not update your original blog posts. Links will be replaced only before the output on non-default languages.
ru_ru: * Это не приведет к обновлению исходных сообщений в блоге. Ссылки будут заменены только перед выводом на нестандартные языки.

source: * These shortcodes work only for these settings. They will not work anywhere else and cannot be used on your blog posts.
ru_ru: * Эти короткие коды работают только для этих настроек. Они больше нигде не будут работать и не могут быть использованы в ваших сообщениях в блоге.

source: * Make sure to use the correct text in "Original Link" box. If you enter <code>wikipedia.com</code>, you will have <ins>en.es.wikipedia.com</ins> on your website. Correct option is <code>en.wikipedia.com</code>.
ru_ru: * Обязательно используйте правильный текст в поле «Исходная ссылка». Если вы введете <code>wikipedia.com</code>, на вашем веб-сайте появится <ins>en.es.wikipedia.com</ins>. Правильный вариант: <code>en.wikipedia.com</code>.

source: Use these utilities for plugin maintainance.
ru_ru: Используйте эти утилиты для обслуживания плагинов.

source: We found %d empty translation records in DB. You can safely remove them for better DB performance.
ru_ru: Мы обнаружили %d пустых записей перевода в БД. Вы можете безопасно удалить их для повышения производительности БД.

source: Delete empty translation from DB
ru_ru: Удалить пустой перевод из БД

source: This will remove all empty translation records from DB.
ru_ru: Это удалит все пустые записи перевода из БД.

source: No empty translations found in DB. This is great!
ru_ru: В БД пустых переводов не найдено. Отлично!

source: We found %d duplicate translation records in DB. You can safely remove them for better DB performance.
ru_ru: Мы обнаружили %d повторяющихся записей перевода в БД. Вы можете безопасно удалить их для повышения производительности БД.

source: Delete duplicate translation from DB
ru_ru: Удалить дубликат перевода из БД

source: Sometimes, duplicate translation records may appear due to poor connection between WordPress and Autoglot servers. This will remove all duplicates except for the most recent one.
ru_ru: Иногда дубликаты записей перевода могут появляться из-за плохого соединения между серверами WordPress и Autoglot. Это удалит все дубликаты, кроме самого последнего.

source: No duplicate translations found in DB. This is great!
ru_ru: Повторяющихся переводов в БД не обнаружено. Отлично!

source: Backup Translations Table
ru_ru: Резервная таблица переводов

source: Backup translations
ru_ru: Резервные переводы

source: This will generate an SQL file with the backup of your translation table. This may take some time and require server resources! Keep in cool and dry place.
ru_ru: Это создаст файл SQL с резервной копией вашей таблицы перевода. Это может занять некоторое время и потребовать ресурсов сервера! Хранить в прохладном и сухом месте.

source: Default Language
ru_ru: Язык по умолчанию

source: Please choose a default language of your site. We will not add language code to the URL of default language.
ru_ru: Пожалуйста, выберите язык по умолчанию для вашего сайта. Мы не будем добавлять код языка к URL-адресу языка по умолчанию.

source: Choose Active Languages
ru_ru: Выбирайте активные языки

source: Autoglot API key
ru_ru: API-ключ Autoglot

source: Your API key
ru_ru: Ваш API-ключ

source: You can get your free API key in your <a href="%s" target="_blank">Autoglot Control Panel</a>
ru_ru: Вы можете получить бесплатный ключ API в <a href="%s" target="_blank">панели управления Autoglot</a>.

source: Enable Translation
ru_ru: Включить перевод

source: By default, only signed-in administrator will see the translation.
ru_ru: По умолчанию перевод увидит только вошедший в систему администратор.

source: Click this checkbox to enable Autoglot translation.
ru_ru: Установите этот флажок, чтобы включить перевод Autoglot.

source: Enable Language Switcher
ru_ru: Включить переключатель языка

source: Enable language switcher popup.
ru_ru: Включить всплывающее окно переключения языка.

source: Disable language switcher popup. You can still use widgets and shortcodes.
ru_ru: Отключить всплывающее окно переключения языка. Вы по-прежнему можете использовать виджеты и шорткоды.

source: 1 minute
ru_ru: 1 минута

source: 10 minutes
ru_ru: 10 минут

source: 30 minutes
ru_ru: 30 минут

source: 1 hour
ru_ru: 1 час

source: 12 hours
ru_ru: 12 часов

source: 1 day
ru_ru: 1 день

source: 1 week
ru_ru: 1 неделя

source: 1 month
ru_ru: 1 месяц

source: List of Languages
ru_ru: Список языков

source: List of Languages and Flags
ru_ru: Список языков и флагов

source: Box with Flags
ru_ru: Коробка с флагами

source: Box with Small Flags
ru_ru: Коробка с флажками

source: Please do not forget to choose languages on next page.
ru_ru: Пожалуйста, не забудьте выбрать языки на следующей странице.

source: Click this checkbox to enable Autoglot translation.
ru_ru: Установите этот флажок, чтобы включить перевод Autoglot.

source: Translation for Admin Only
ru_ru: Перевод только для администратора
