Repository: common-repository/autoglot
Catalog: translation/autoglot-*.po
Languages: ru_ru

source: This can be useful to check translation by admin before publishing it for all visitors. This will hide "alternate hreflang" block and will make widget visible only for admin.
ru_ru: Это может быть полезно для проверки перевода администратором перед публикацией его для всех посетителей. Это скроет блок «альтернативный hreflang» и сделает виджет видимым только для администратора.

source: Site admin will be the only one to see and use Autoglot translation.
ru_ru: Администратор сайта будет единственным, кто сможет видеть и использовать перевод Autoglot.

source: Translation will be available to every user.
ru_ru: Перевод будет доступен каждому пользователю.

source: You can get your API key in your <a href="%s" target="_blank">Autoglot Control Panel</a>
ru_ru: Вы можете получить ключ API в <a href="%s" target="_blank">панели управления Autoglot</a>.

source: Enable Floating Language Switcher
ru_ru: Включить плавающий переключатель языка

source: You can adjust custom CSS with id #ag_floatblox.
ru_ru: Вы можете настроить собственный CSS с помощью id #ag_floatblox.

source: Enable floating box that will open language switcher popup.
ru_ru: Включите плавающее поле, которое откроет всплывающее окно переключения языка.

source: Disable floating box. You can still use widgets and shortcodes.
ru_ru: Отключить плавающее поле. Вы по-прежнему можете использовать виджеты и шорткоды.

source: Type of Language Switcher in Popup
ru_ru: Тип переключателя языка во всплывающем окне

source: Type of language switcher in popup.
ru_ru: Тип переключателя языка во всплывающем окне.

source: Translation Priority
ru_ru: Приоритет перевода

source: If you choose to translate before page generation, certain plugins may add content after translation that will be shown in default language.<br />If you choose to translate after page generation, all content will be translated. However, if a plugin alters content often, it will be often re-translated that may cause additional charges.
ru_ru: Если вы решите перевести до создания страницы, некоторые плагины могут добавить контент после перевода, который будет отображаться на языке по умолчанию.<br />Если вы решите перевести после создания страницы, весь контент будет переведен. Однако, если плагин часто меняет контент, он будет часто переводиться повторно, что может привести к дополнительным расходам.

source: Translate After Page Generation (recommended!)
ru_ru: Перевести после создания страницы (рекомендуется!)

source: Translate Before Page Generation
ru_ru: Перевести перед созданием страницы

source: Additional Strings for Translation
ru_ru: Дополнительные строки для перевода

source: String that is not translated.
ru_ru: Строка, которая не переведена.

source: Please enter strings that are not automatically translated. They can be hard-coded in plugins, themes, or even functions. Please include all HTML code, if necessary.
ru_ru: Введите строки, которые не переводятся автоматически. Они могут быть жестко запрограммированы в плагинах, темах или даже функциях. При необходимости включите весь HTML-код.

source: Resend Low Balance Notifications
ru_ru: Повторная отправка уведомлений о низком балансе

source: How often to send low balance notifications to admin e-mail. Minimum delay before resending a notification.
ru_ru: Как часто отправлять уведомления о низком балансе на электронную почту администратора. Минимальная задержка перед повторной отправкой уведомления.

source: Show "alternate hreflang" Block
ru_ru: Показать блок «альтернативный hreflang»

source: Show section with "alternate hreflang" links to other languages on each page.
ru_ru: Показывать раздел со ссылками «альтернативный hreflang» на другие языки на каждой странице.

source: Show hreflangs
ru_ru: Показать теги hreflangs

source: Hide hreflangs
ru_ru: Скрыть теги hreflangs

source: Show custom HTML titles on certain pages
ru_ru: Показывать пользовательские заголовки HTML на определенных страницах

source: Show custom (almost WordPress default) HTML titles on search results, categories, tags, taxonomies, and archive pages. These titles will be generated by Autoglot in order to minimize translation costs. Otherwise, each title will be translated for each tag, category, and even search request.
ru_ru: Покажите пользовательские (почти по умолчанию в WordPress) HTML-заголовки в результатах поиска, категориях, тегах, таксономиях и страницах архива. Эти названия будут созданы Autoglot, чтобы минимизировать затраты на перевод. В противном случае каждый заголовок будет переведен для каждого тега, категории и даже поискового запроса.

source: Show custom Autoglot titles
ru_ru: Показывать пользовательские названия Autoglot

source: Show default titles (by WordPress or SEO plugin)
ru_ru: Показывать заголовки по умолчанию (с помощью плагина WordPress или SEO)

source: Improve Content After Translation
ru_ru: Улучшите контент после перевода

source: Manualy call wptexturize() funciton after translation. This is default for Wordpress.
ru_ru: Вручную вызовите функцию wptexturize() после перевода. Это значение по умолчанию для Wordpress.

source: Use wptexturize()
ru_ru: Используйте wptexturize()

source: Skip wptexturize()
ru_ru: Пропустить wptexturize()

source: Show Widget Signature
ru_ru: Показать подпись виджета

source: Show "Powered by" widget signature with a link to official Autoglot.com website.
ru_ru: Показывать подпись виджета «Powered by» со ссылкой на официальный сайт Autoglot.com.

source: Show
ru_ru: Показывать

source: Hide
ru_ru: Скрывать

source: Decrease Page Priorities in Sitemap
ru_ru: Уменьшить приоритет страниц в файле Sitemap

source: Reduce translated page priority in sitemaps. Not compatible with every sitemap generation plugin.
ru_ru: Уменьшите приоритет переведенных страниц в картах сайта. Несовместимо со всеми плагинами для создания карты сайта.

source: Links or Text For Replacement
ru_ru: Ссылки или текст для замены

source: Original Links or Text, one per line.
ru_ru: Исходные ссылки или текст, по одной в строке.

source: Replaced Links or Text, one per line
ru_ru: Заменены ссылки или текст, по одной в строке.

source: Please then set you API key in <a href="%s">Autoglot Settings Page</a>.
ru_ru: Затем установите свой ключ API на <a href="%s">странице настроек Autoglot</a>.

source: We could not connect to Autoglot API with your API key and received the following response:
ru_ru: Нам не удалось подключиться к API Autoglot с помощью вашего ключа API и мы получили следующий ответ:

source: Your Autoglot translation balance is empty. Please login to <a href="%s" target="_blank">Autoglot Control Panel</a> and replenish your translation balance.
ru_ru: Ваш баланс переводов Autoglot пуст. Пожалуйста, войдите в <a href="%s" target="_blank">Панель управления Autoglot</a> и пополните баланс переводов.

source: Your Autoglot translation balance is low. Please login to <a href="%s" target="_blank">Autoglot Control Panel</a> and replenish your translation balance.
ru_ru: Ваш баланс переводов Autoglot низкий. Пожалуйста, войдите в <a href="%s" target="_blank">Панель управления Autoglot</a> и пополните баланс переводов.

source: Set up your API key here to start
ru_ru: Чтобы начать, настройте здесь свой ключ API.

source: Total Number of Lines:
ru_ru: Общее количество строк:

source: Check all
ru_ru: Отметить все

source: Uncheck all
ru_ru: Снять все

source: Your API key is not valid.
ru_ru: Ваш ключ API недействителен.

source: Please login to Autoglot Control Panel and retrieve your API key.
ru_ru: Пожалуйста, войдите в панель управления Autoglot и получите свой ключ API.

source: Add New Text Replacement Record
ru_ru: Добавить новую запись замены текста

source: Add New Text Replacement
ru_ru: Добавить новую замену текста

source: New Item
ru_ru: Новый товар

source: Edit Record
ru_ru: Редактировать запись

source: Update Record
ru_ru: Обновить запись

source: View Record
ru_ru: Посмотреть запись

source: View Records
ru_ru: Просмотр записей

source: Search Records
ru_ru: Поиск записей

source: Not found
ru_ru: Не найдено

source: Not found in Trash
ru_ru: Не найдено в корзине

source: Insert into item
ru_ru: Вставить в элемент

source: Items list
ru_ru: Список предметов

source: Items list navigation
ru_ru: Навигация по списку товаров

source: Filter items list
ru_ru: Фильтровать список элементов

source: Text Record
ru_ru: Текстовая запись

source: Please enter the name of your text record
ru_ru: Пожалуйста, введите название вашей текстовой записи

source: Please choose a name of your text record (only visible for site administrator), content in your default language that will be replaced, and content for each language where you want your content replaced. If you don't set a new content for any particular language, default content will be displayed.
ru_ru: Выберите имя вашей текстовой записи (видно только администратору сайта), контент на языке по умолчанию, который будет заменен, и контент для каждого языка, на котором вы хотите заменить контент. Если вы не установили новый контент для какого-либо конкретного языка, будет отображаться контент по умолчанию.

source: Warning: you have not specified default language content that should be replaced. That's OK, we will save the record but it will not work.
ru_ru: Внимание: вы не указали языковой контент по умолчанию, который следует заменить. Ничего страшного, мы сохраним запись, но она не будет работать.

source: Please enter content that should be replaced when switching to another language.
ru_ru: Введите контент, который необходимо заменить при переключении на другой язык.

source: Content in your default language.
ru_ru: Содержимое на языке по умолчанию.

source: Please enter content that will be shown in each other language.
ru_ru: Введите контент, который будет отображаться на каждом языке.

source: This color means currently active language.
ru_ru: Этот цвет означает активный в данный момент язык.

source: Language
ru_ru: Язык

source: Language code
ru_ru: Код языка

source: New content
ru_ru: Новый контент

source: Back to list
ru_ru: Обратно к списку

source: The "Text Replacement" feature of Autoglot plugin lets you easily change pieces of content on your translated pages.
ru_ru: Функция «Замена текста» плагина Autoglot позволяет легко менять фрагменты контента на переведенных страницах.

source: This can be useful for:
ru_ru: Это может быть полезно для:

source: Displaying different affiliate or any other links on different language pages of your blog, e.g. <ins>https://www.amazon.com/product-one</ins> may be replaced with <ins>https://www.amazon.es/producto-uno</ins> on your Spanish pages.
ru_ru: Отображение разных партнерских или любых других ссылок на разных языковых страницах вашего блога, например. <ins>https://www.amazon.com/product-one</ins> можно заменить на <ins>https://www.amazon.es/producto-uno</ins> на ваших страницах на испанском языке.

source: Embedding different videos on different language pages of your blog, e.g. youtube.com/watch?v=EnglishVideoCode may be replaced with youtube.com/watch?v=GermanVideoCode on your German pages.
ru_ru: Встраивание разных видео на разные языковые страницы вашего блога, например. youtube.com/watch?v=EnglishVideoCode можно заменить на youtube.com/watch?v=НемецкийVideoCode на страницах на немецком языке.

source: And so on...
ru_ru: И так далее...

source: * Please note, text replacement happens after translation of content.
ru_ru: * Обратите внимание, замена текста происходит после перевода контента.

source: # of replacement records
ru_ru: количество записей для замены

source: %d empty translation records have been deleted from DB.
ru_ru: %d пустых записей перевода удалено из БД.

source: Back to utilities page
ru_ru: Вернуться на страницу утилит

source: %d duplicate translation records have been deleted from DB.
ru_ru: %d повторяющихся записей перевода удалены из базы данных.

source: Autoglot Plugin Dashboard
ru_ru: Панель управления плагином Autoglot

source: Your settings have been updated!
ru_ru: Ваши настройки обновлены!

source: Autoglot Plugin Settings
ru_ru: Настройки плагина Autoglot

source: Autoglot Plugin Setup Wizard
ru_ru: Мастер установки плагина Autoglot

source: Step 1. Setup your API Key.
ru_ru: Шаг 1. Настройте свой ключ API.

source: Step 2. Choose Languages.
ru_ru: Шаг 2. Выберите Языки.

source: Step 3. Plugin is Ready!
ru_ru: Шаг 3. Плагин готов!

source: Skip Setup Wizard
ru_ru: Пропустить мастер установки

source: Reset and Restart
ru_ru: Сброс и перезагрузка

source: Save and continue
ru_ru: Сохранить и продолжить

source: Autoglot Plugin Utilities
ru_ru: Утилиты плагина Autoglot

source: There was an error during installation or activation of Autoglot plugin:
ru_ru: При установке или активации плагина Autoglot произошла ошибка:

source: Notification of Low Translation Balance
ru_ru: Уведомление о низком балансе перевода

source: Hello site administrator!
ru_ru: Здравствуйте администратор сайта!

source: This is a notification from Autoglot translation plugin installed on:
ru_ru: Это уведомление от плагина перевода Autoglot, установленного на:

source: Your translation balance is either too low or empty and therefore Autoglot cannot automatically translate new content. Although your WordPress site will continue to display your previously translated content, we suggest that you replenish your translation balance in your Autoglot Control Panel
ru_ru: Ваш баланс переводов либо слишком мал, либо пуст, поэтому Autoglot не может автоматически переводить новый контент. Хотя ваш сайт WordPress продолжит отображать ранее переведенный контент, мы рекомендуем вам пополнить баланс перевода в панели управления Autoglot.

source: Once you increase your translation balance, we will continue automatically translating your WordPress website.
ru_ru: Как только вы увеличите баланс перевода, мы продолжим автоматически переводить ваш сайт WordPress.

source: Best Regards,
ru_ru: С наилучшими пожеланиями,

source: Failed to send e-mail notification, function "wp_mail" not found. Your translation balance is either too low or empty and therefore Autoglot cannot automatically translate new content.
ru_ru: Не удалось отправить уведомление по электронной почте, функция «wp_mail» не найдена. Ваш баланс переводов либо слишком мал, либо пуст, поэтому Autoglot не может автоматически переводить новый контент.

source: Autoglot WP Translation Widget
ru_ru: Виджет перевода Autoglot WP

source: Widget Title
ru_ru: Название виджета

source: Selector Style
ru_ru: Стиль селектора
